# SQL Assignment: Orders Table Analysis

This notebook sets up an SQLite database, creates the **orders** table, inserts data, and answers 10 case study questions using SQL queries displayed via pandas.

In [ ]:
# ðŸ“˜ Setup SQLite and Pandas
import sqlite3
import pandas as pd

# Create connection to in-memory SQLite DB
conn = sqlite3.connect(":memory:")
cursor = conn.cursor()

In [ ]:
# ðŸ“¦ Create table and insert data
cursor.executescript(""\ 
CREATE TABLE orders (
    customer_id INT,
    order_date DATE,
    item VARCHAR(100),
    quantity INT,
    price DECIMAL(10, 2)
);

INSERT INTO orders (customer_id, order_date, item, quantity, price)
VALUES
    (10330, '1999-06-30', 'Pogo stick', 1, 28.00),
    (10101, '1999-06-30', 'Raft', 1, 58.00),
    (10298, '1999-07-01', 'Skateboard', 1, 33.00),
    (10101, '1999-07-01', 'Life Vest', 4, 125.00),
    (10299, '1999-07-06', 'Parachute', 1, 1250.00),
    (10339, '1999-07-27', 'Umbrella', 1, 4.50),
    (10449, '1999-08-13', 'Unicycle', 1, 180.79),
    (10439, '1999-08-14', 'Ski Poles', 2, 25.50),
    (10101, '1999-08-18', 'Rain Coat', 1, 18.30),
    (10449, '1999-09-01', 'Snow Shoes', 1, 45.00),
    (10439, '1999-09-18', 'Tent', 1, 88.00),
    (10298, '1999-09-19', 'Lantern', 2, 29.00),
    (10410, '1999-10-28', 'Sleeping Bag', 1, 89.22),
    (10438, '1999-11-01', 'Umbrella', 1, 6.75),
    (10438, '1999-11-02', 'Pillow', 1, 8.50),
    (10298, '1999-12-01', 'Helmet', 1, 22.00),
    (10449, '1999-12-15', 'Bicycle', 1, 380.50),
    (10449, '1999-12-22', 'Canoe', 1, 280.00),
    (10101, '1999-12-30', 'Hoola Hoop', 3, 14.75),
    (10330, '2000-01-01', 'Flashlight', 4, 28.00),
    (10101, '2000-01-02', 'Lantern', 1, 16.00),
    (10299, '2000-01-18', 'Inflatable Mattress', 1, 38.00),
    (10438, '2000-01-18', 'Tent', 1, 79.99),
    (10413, '2000-01-19', 'Lawnchair', 4, 32.00),
    (10410, '2000-01-30', 'Unicycle', 1, 192.50),
    (10315, '2000-02-02', 'Compass', 1, 8.00),
    (10449, '2000-02-29', 'Flashlight', 1, 4.50),
    (10101, '2000-03-08', 'Sleeping Bag', 2, 88.70),
    (10298, '2000-03-18', 'Pocket Knife', 1, 22.38),
    (10449, '2000-03-19', 'Canoe paddle', 2, 40.00),
    (10298, '2000-04-01', 'Ear Muffs', 1, 12.50),
    (10330, '2000-04-19', 'Shovel', 1, 16.75);
""")
conn.commit()

### Q1. Items for customer 10449

In [ ]:
pd.read_sql_query("SELECT * FROM orders WHERE customer_id = 10449;", conn)

### Q2. Avg price in December

In [ ]:
pd.read_sql_query("SELECT AVG(price) FROM orders WHERE strftime('%m', order_date) = '12';", conn)

### Q3. Lowest tent price

In [ ]:
pd.read_sql_query("SELECT MIN(price) FROM orders WHERE item = 'Tent';", conn)

### Q4. Max & Min price per item

In [ ]:
pd.read_sql_query("SELECT item, MAX(price), MIN(price) FROM orders GROUP BY item;", conn)

### Q5. Items with max price > 190

In [ ]:
pd.read_sql_query("SELECT item, MAX(price) FROM orders GROUP BY item HAVING MAX(price) > 190.00;", conn)

### Q6. Items with price > 10 ASC

In [ ]:
pd.read_sql_query("SELECT item, price FROM orders WHERE price > 10.00 ORDER BY price ASC;", conn)

### Q7. Exclude Snow Shoes & Ear Muffs

In [ ]:
pd.read_sql_query("SELECT customer_id, order_date, item FROM orders WHERE item NOT IN ('Snow Shoes', 'Ear Muffs');", conn)

### Q8. Items starting with S or P

In [ ]:
pd.read_sql_query("SELECT item, price FROM orders WHERE item LIKE 'S%' OR item LIKE 'P%';", conn)

### Q9. Price between 10 and 80

In [ ]:
pd.read_sql_query("SELECT order_date, item, price FROM orders WHERE price BETWEEN 10.00 AND 80.00;", conn)

### Q10. Unit price per item

In [ ]:
pd.read_sql_query("SELECT item, SUM(price)/SUM(quantity) AS unit_price FROM orders GROUP BY item ORDER BY unit_price DESC;", conn)